hw4/app/controllers/dogs_controller.rb

  def create
    @dog = Dog.create(user_params)
---
INSERT INTO "dogs" ("age", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["age", 2], ["created_at", "2015-10-09 04:54:52.140766"], ["name", "dog"], ["updated_at", "2015-10-09 04:54:52.140766"]]