hw3/app/controllers/pages_controller.rb

  def index
    @Users = User.all
    @Cats = Cat.all
    @Todos = Todo.all
---
SELECT "users".* FROM "users"
SELECT "cats".* FROM "cats"
SELECT "todos".* FROM "todos"