proj1/app/views/trainers/show.html.erb

<h3>Pokemon<h3>
<% @trainer.pokemons.each do |pokemon| %>
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 5]]