proj1/app/controllers/pokemons_controller.rb

  def capture
    pokemon = Pokemon.find(params[:id])
    pokemon.trainer_id = current_trainer.id
    pokemon.save
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 5], ["updated_at", "2015-10-30 01:14:03.179500"], ["id", 4]]

  def damage
    pokemon = Pokemon.find(params[:id])
    pokemon.health = pokemon.health - 10
    pokemon.save
    if pokemon.health <= 0
      pokemon.destroy
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2015-10-30 03:12:25.981340"], ["id", 4]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 5]]

  def create
    name = params[:pokemon][:name]
    @pokemon = Pokemon.create(name: name, level: 1, health: 100, trainer_id: current_trainer.id)
---
INSERT INTO "pokemons" ("name", "level", "health", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "name"], ["level", 1], ["health", 100], ["trainer_id", 5], ["created_at", "2015-10-30 03:34:06.249427"], ["updated_at", "2015-10-30 03:34:06.249427"]]